//
//		Таймер с уберточностью, спасибо Стёпе за него //дополнено конструктором с double
//
#include "stdafx.h"
// ---------------------------------------------------------------------------

#pragma hdrstop

#include <windows.h>
//#include <Dialogs.hpp>

#include "ticker.h"

// ---------------------------------------------------------------------------
#pragma package(smart_init)

// ---------------------------------------------------------------------------
// ---------------------------------------------------------------------------
// ---------------------------------------------------------------------------
// ---------------------------------------------------------------------------
// ---------------------------------------------------------------------------
FrequencyTimer::FrequencyTimer() {
	ElapsedTime = 0;
	MeasurementUnit = 1;
}
FrequencyTimer::FrequencyTimer(double Unit) {
	ElapsedTime = 0;
	MeasurementUnit = 1;
}
// ---------------------------------------------------------------------------
void FrequencyTimer::SetMeasurementUnit(double Unit) {
	MeasurementUnit = Unit;
}

// ---------------------------------------------------------------------------
void FrequencyTimer::Start() {
	QueryPerformanceFrequency((PLARGE_INTEGER) & Frequency);
	QueryPerformanceCounter((PLARGE_INTEGER) & StartingTime);
}

// ---------------------------------------------------------------------------
void FrequencyTimer::Stop() {
	QueryPerformanceCounter((PLARGE_INTEGER) & EndingTime);
	ElapsedTime += (double)(EndingTime - StartingTime)
		* MeasurementUnit / Frequency;
}

// ---------------------------------------------------------------------------
void FrequencyTimer::Reset() {
	ElapsedTime = 0;
}

// ---------------------------------------------------------------------------
double FrequencyTimer::GetTime() {
	return ElapsedTime;
}

// ---------------------------------------------------------------------------
// ---------------------------------------------------------------------------
// ---------------------------------------------------------------------------
// ---------------------------------------------------------------------------
// ---------------------------------------------------------------------------
